app/controllers/prov_xns_controller.rb

  def index
    @prov_xns = ProvXn.all
---
SELECT * FROM `prov_xns`

  def show

    logger.debug("ProvXnsController.show() param id: [#{params[:id]}]")

    # logger.debug("loadpath : #{$LOAD_PATH}")

    @prov_xn = ProvXn.find(params[:id])
---
SELECT * FROM `prov_xns` WHERE (`prov_xns`.`id` = 1)

  def create
    @prov_xn = ProvXn.new(params[:prov_xn])

    respond_to do |format|
      if @prov_xn.save
---
INSERT INTO `prov_xns` (`employeenumber`, `givenname`, `updated_at`, `userclass`, `operator`, `uid`, `sessionid`, `dn`, `userpassword`, `created_at`) VALUES('113660136', 'felice', '2009-10-15 17:32:52', 'staff', 'gregf', 'testuseruid', '3452394578923745', 'xxx', 'password', '2009-10-15 17:32:52')